
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/nyshk97/aws-ecs-terraform/actions/runs/6258942383)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-083229c009d2de319]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b6e7990e665c661f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ded2aaadc5bb0224]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07a38580cf08b9976]
aws_security_group.ecs: Refreshing state... [id=sg-0d988622b7767ecfd]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07300af33a9c001a8]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d03142caa758fc29]
aws_security_group.alb: Refreshing state... [id=sg-03345e2bb275c36d0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e2ae3c2ef6c9deac]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01db1c87703bd6a1d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb8be38df8114563]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f326f6a06eef180]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0581be1e8fb9f4a87]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0807f0dec95bec02b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a9c4fbae37afe4e5]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3223306409]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0734164d7a254ad13]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cb8be38df81145631080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f509b7de90ca1df0]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b13f439843b02a26]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09141fa82cbb4af19]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0183803c6e9b85e9b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-01d5f76fbea4c8cac]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-039e20af860695e54]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d03142caa758fc291080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ded2aaadc5bb02241080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-03345e2bb275c36d0",
        ]
      + subnets                                     = [
          + "subnet-0581be1e8fb9f4a87",
          + "subnet-09f326f6a06eef180",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-083229c009d2de319"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:targetgroup/go-simple-server-target-group/de495f82d481b490]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m15s [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:loadbalancer/app/go-simple-server-alb/e7b741708e939369]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener-rule/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1/bf80c2b56a7e5e6b]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"55502e6362f699b0932cabdc85c06819da562f72","Vars":{},"WorkflowName":"Terraform"} -->